[
  {
    "lesson": 2,
    "content": [
      {
        "id": 1,
        "vocabulary": "compression",
        "pronunciation": "/kəmˈpres/",
        "meaning": "a method of packing data in order to save disk storage space or download time",
        "example": "ZIP is an example of a common file compression algorithm."
      },
      {
        "id": 2,
        "vocabulary": "driver",
        "pronunciation": "/ˈdraɪvə/",
        "meaning": " a software component that lets the operating system and a device communicate with each other",
        "example": "The IT support technician asked the end user if he had recently updated any device drivers."
      },
      {
        "id": 3,
        "vocabulary": "permission",
        "pronunciation": "/pəˈmɪʃən/",
        "meaning": "a set of strict rules for controlling read, write and execute access to a file or directory",
        "example": "The company switched from FAT32 to the NTFS file system because the former did not support file permissions."
      },
      {
        "id": 4,
        "vocabulary": "format",
        "pronunciation": "/ˈfɔːmæt/",
        "meaning": "prepare a device to store data, erasing any existing data",
        "example": "One must format a flash memory drive or a hard disk drive before it can be used to store data."
      },
      {
        "id": 5,
        "vocabulary": "kernel",
        "pronunciation": " /ˈkɜːnl/",
        "meaning": "the fundamental part of an operating system is responsible for resource management and file access",
        "example": "The system administrator needed to upgrade the kernel in order to provide native support for Serial ATA drives."
      },
      {
        "id": 6,
        "vocabulary": "OS (Operating System)",
        "pronunciation": "/ˈɒp.ər.eɪ.tɪŋ/ /ˈsɪs.təm/",
        "meaning": "a GUI or CLI software link between the computer and the operator",
        "example": "The programmer tested his code on many operating systems including Windows, macOS, and Linux."
      },
      {
        "id": 7,
        "vocabulary": "VM (virtual machine)",
        "pronunciation": "/ˈvɜː.tʃu.əl/ /məˈʃiːn/",
        "meaning": "a computer resource that uses software instead of a physical computer to run programs and deploy apps",
        "example": "In order to run Java programs in Windows, one needs to download an appropriate virtual machine."
      }
    ]
  }
]
